#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```
module.keycloak_prod.module.onestopauth.module.client_junmin-client-test-101.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=609796e7-afcf-4900-9548-a4f533fe2d8d]
module.keycloak_prod.module.onestopauth.module.client_august-19-741-pm-694.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=e77da751-8434-416c-88ca-875a02fe3666]
module.keycloak_prod.module.onestopauth.module.client_test-3-08-10-2021-465.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=61182e46-69f7-48e4-9123-a416cd756b42]
module.keycloak_prod.module.onestopauth.module.client_test-958.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=45407cf9-c8bc-40da-8e0d-5fe8f235ed80]
module.keycloak_prod.module.onestopauth.module.client_august-19-741-pm-694.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=14f0d0bc-2ddb-46a0-bf05-a4212c669e90]
module.keycloak_prod.module.onestopauth.module.client_test-958.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=b3e3b342-34c3-48e5-becf-a595b8dcec14]
module.keycloak_prod.module.onestopauth.module.client_test-958.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=4f2801ad-10f2-4a23-b9a1-d675fbdc8f3a]
module.keycloak_prod.module.onestopauth.module.client_project-test-7-27-2021-67.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=fdf4062e-f9f7-43d0-8285-9067d08d16d1]
module.keycloak_prod.module.onestopauth.module.client_project-test-7-27-2021-67.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=f29c6f71-887b-4048-8829-8aa80059eb6d]
module.keycloak_prod.module.onestopauth.module.client_project-test-7-27-2021-67.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=084b5417-8054-4c25-ad8a-88fd1ed4ef64]
module.keycloak_prod.module.onestopauth.module.client_project-sso-1189.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=ea2b18ca-136e-48bd-9881-80bd92853adc]
module.keycloak_prod.module.onestopauth.module.client_asdfsafa-1322.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=9b00de4d-9287-4029-9252-75b9154b4c83]
module.keycloak_prod.module.onestopauth.module.client_asdfsafa-1322.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=11856829-e83f-449d-8e58-ebdb1dd3be0d]
module.keycloak_prod.module.onestopauth.module.client_asdfsafa-1322.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=3257b1d3-b6ac-41cf-8cf9-d155d46ae855]
module.keycloak_prod.module.onestopauth.module.client_asdf-2222222222-1.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=7be05a4d-094f-469a-ac5c-49337733d4af]
module.keycloak_prod.module.onestopauth.module.client_jon-test-1-235.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=357064d1-2d0a-45af-a541-63e267bec570]
module.keycloak_prod.module.onestopauth.module.client_test-5-08-09-2021-338.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=6718c50a-5b43-48a1-a308-2bbb573dd8d2]
module.keycloak_prod.module.onestopauth.module.client_project-sso-1189.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=bf74d990-afd7-4ab9-be07-4255d2a879cd]
module.keycloak_prod.module.onestopauth.module.client_project-sso-1189.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=8d48f713-d801-4b1a-b673-2526bfbd1a65]
module.keycloak_prod.module.onestopauth.module.client_project-sso-1189.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=664ad5eb-7cbe-446d-8e4d-96eb35d05c7f]
module.keycloak_prod.module.onestopauth.module.client_project-sso-1189.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=084ee4fb-0763-4349-a3ce-b74d4736919d]
module.keycloak_prod.module.onestopauth.module.client_project-sso-1189.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=ed120fe6-ab29-477b-9032-ce73812a7aea]
module.keycloak_prod.module.onestopauth.module.client_test-232.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=98f7b486-3ddd-4e63-94b3-9cc5b88e6129]
module.keycloak_prod.module.onestopauth.module.client_test-232.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=bcb39359-cbec-448b-9152-39c873d7e02f]
module.keycloak_prod.module.onestopauth.module.client_test-232.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=abf44b0b-5b22-49b7-a2e0-41d4dca39373]
module.keycloak_prod.module.onestopauth.module.client_test-232.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=0b155a4b-3ff5-44ac-9ee6-ac3cf355df70]
module.keycloak_prod.module.onestopauth.module.client_test-regression-1257.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=65171f2d-1e26-4d50-9771-e61febab078b]
module.keycloak_prod.module.onestopauth.module.client_asdf-2222222222-1.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=e03d4f9c-f63a-42d7-8625-4bf4dddca852]
module.keycloak_prod.module.onestopauth.module.client_test-5-08-09-2021-338.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=5dc8fb13-4de8-4985-b725-ac18bdc749f2]
module.keycloak_prod.module.onestopauth.module.client_asdf-2222222222-1.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=d802cc97-e3e4-4e71-869b-096a03628c39]
module.keycloak_prod.module.onestopauth.module.client_asdf-2222222222-1.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=652cb0a5-514b-4ed4-9455-7b4fe53d695c]
module.keycloak_prod.module.onestopauth.module.client_test-5-08-09-2021-338.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=113ae672-7094-4d95-95a0-cf4011434621]
module.keycloak_prod.module.onestopauth.module.client_asdf-2222222222-1.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=c1eb19d9-89b2-4fc0-ae40-6d012c908837]
module.keycloak_prod.module.onestopauth.module.client_test-232.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=3a89d798-7402-41de-9187-bd5846acbc43]
module.keycloak_prod.module.onestopauth.module.client_test-232.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=30f052ff-74d6-4cd4-a443-32c5653733bd]
module.keycloak_prod.module.onestopauth.module.client_test-232.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=b16b3b13-ff2f-4284-a4d1-1e85fc039180]
module.keycloak_prod.module.onestopauth.module.client_test-232.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=c42ffd87-3e0a-4530-9949-d9755d34ab84]
module.keycloak_prod.module.onestopauth.module.client_jon-test-8-108.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=57c1ee94-f80f-436f-9885-613c2ec968dc]
module.keycloak_prod.module.onestopauth.module.client_jon-test-8-108.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=c4e64dfe-9cf3-41e0-807a-f33360e63bc9]
module.keycloak_prod.module.onestopauth.module.client_jon-test-8-108.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=5fd64e8a-138c-409a-8adf-fb7ec3893b0a]
module.keycloak_prod.module.onestopauth.module.client_jon-test-8-108.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=e5375a90-be56-4986-b3bb-e1977a0ad158]
module.keycloak_prod.module.onestopauth.module.client_jon-test-8-108.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=6b09b865-d8b1-49c4-830f-3afc5bf696c9]
module.keycloak_prod.module.onestopauth.module.client_asdf-2222222222-1.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=dd19786b-6e93-4234-ad04-da2d994bf7c9]
module.keycloak_prod.module.onestopauth.module.client_asdf-2222222222-1.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=9e66abb4-b63a-4501-afad-756dd34cde3c]
module.keycloak_prod.module.onestopauth.module.client_test-regression-1257.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=00f73562-d869-4365-8ff1-a5328d8b092c]
module.keycloak_prod.module.onestopauth.module.client_jon-test-1-235.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=51b13624-6a43-418e-89e3-ab20befcdf10]
module.keycloak_prod.module.onestopauth.module.client_jon-test-8-108.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=2846153c-6f2a-4ddc-a7ea-0b9125e49b55]
module.keycloak_prod.module.onestopauth.module.client_jon-test-8-108.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=49f8b227-6f1b-4cae-b3e4-1e8f6f3da8f2]
module.keycloak_prod.module.onestopauth.module.client_jon-test-8-108.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=80231ac9-dfb3-40b4-a473-11f9730b9afe]
module.keycloak_prod.module.onestopauth.module.client_mylastproject-166.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=b8e25338-6994-4880-bc01-fba251d191dc]
module.keycloak_prod.module.onestopauth.module.client_mylastproject-166.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=b6d2a767-0a8e-48fd-9af8-8c3e7af499af]
module.keycloak_prod.module.onestopauth.module.client_mylastproject-166.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=dfecb841-fc5a-4ada-95ee-7862304ed89a]
module.keycloak_prod.module.onestopauth.module.client_3-test-for-v-1-239.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=f4e10d15-e04e-4027-a75e-ce0212eab4a0]
module.keycloak_prod.module.onestopauth.module.client_test-project-1-663.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=3304da8b-80ef-4cad-8731-3bdffaa5841d]
module.keycloak_prod.module.onestopauth.module.client_3-test-for-v-1-239.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=29cfd2d3-5191-4f18-b310-31ba3d1a1415]
module.keycloak_prod.module.onestopauth.module.client_3-test-for-v-1-239.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=3972f8ee-e4f4-4415-a6eb-324ffbbaa3b7]
module.keycloak_prod.module.onestopauth_business.module.client_bceidbasic-idir-devtestprod-3567.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=96b6cb26-9ec1-4a8d-8361-eb21168756ce]
module.keycloak_prod.module.onestopauth.module.client_mylastproject-166.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=c7e53d61-b2ac-4ff1-aac1-e1d6fb3ff292]
module.keycloak_prod.module.onestopauth.module.client_mylastproject-166.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=5ca5a527-eb46-4a87-8c2e-dec2a1ce581d]
module.keycloak_prod.module.onestopauth.module.client_test-project-1-663.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=a9015836-2091-4acd-9661-8da94dfdcdf8]
module.keycloak_prod.module.onestopauth.module.client_3-test-for-v-1-239.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=3f89b042-ccf7-40b8-8cd5-c6a362474135]
module.keycloak_prod.module.onestopauth.module.client_mylastproject-166.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=32a65459-8143-4452-b2b9-20c09b3970f3]
module.keycloak_prod.module.onestopauth.module.client_3-test-for-v-1-239.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=76d8c310-d0e6-4911-aea1-27d16cc282fe]
module.keycloak_prod.module.onestopauth.module.client_mylastproject-166.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=69f112e8-3c0a-4130-b4cf-b0c99a01ba79]
module.keycloak_prod.module.onestopauth.module.client_3-test-for-v-1-239.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=a9603c3a-f974-4167-a255-ee39e6272f66]
module.keycloak_prod.module.onestopauth.module.client_3-test-for-v-1-239.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=4e7899c0-1fe9-48c7-ab88-7421b9407c68]
module.keycloak_prod.module.onestopauth_business.module.client_bceidbasic-idir-devtestprod-3567.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=ac9f8594-a744-4ad6-97a5-0d5ed27eef5f]
module.keycloak_prod.module.onestopauth.module.client_mylastproject-166.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=829ea884-556d-44dc-baaf-b3e019db8362]
module.keycloak_prod.module.onestopauth.module.client_test-project-1-663.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=98622929-a467-4fdb-87a5-f5a30c2cd6d9]
module.keycloak_prod.module.onestopauth.module.client_test-project-1-663.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=1fe44581-bdd1-4b95-9b97-9b278c636138]
module.keycloak_prod.module.onestopauth.module.client_test-project-1-663.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=e01b4353-6cd4-42d8-80a7-b82ec3a10e16]
module.keycloak_prod.module.onestopauth.module.client_test-project-1-663.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=ac232062-3966-4084-a304-352b25335404]
module.keycloak_prod.module.onestopauth_business.module.client_bceidbasic-idir-devtestprod-3567.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=8100b553-c9fa-45ca-bc0c-8c76f9aaf429]
module.keycloak_prod.module.onestopauth_business.module.client_bceidbasic-idir-devtestprod-3567.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=6d6060db-8180-4499-9d3e-dfee55b6742d]
module.keycloak_prod.module.onestopauth.module.client_test-project-1-663.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=4850dbc0-5e81-45b2-96c8-367d4e80b0f7]
module.keycloak_prod.module.onestopauth.module.client_test-project-1-663.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=0259a363-869c-4442-ace2-9e6bff714846]
module.keycloak_prod.module.onestopauth.module.client_3-test-for-v-1-239.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=12cdc048-9154-496a-8771-6ce4b4da69a3]
module.keycloak_prod.module.onestopauth_business.module.client_bceidbasic-idir-devtestprod-3567.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=1b05ecb5-0063-4884-81f4-4a10d820ba36]
module.keycloak_prod.module.onestopauth_business.module.client_bceidbasic-idir-devtestprod-3567.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=56beaef5-2ded-4295-b2e7-20756dc204ac]
module.keycloak_prod.module.onestopauth_business.module.client_bceidbasic-idir-devtestprod-3567.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=57775bf3-a8a0-4fc8-a32d-c99ca1c2cfee]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=65845072-a61d-4c8a-bdb3-824835aebac7]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=5c4cac7f-0510-496d-94c4-3c6ca11818e7]
module.keycloak_prod.module.onestopauth_business.module.client_bceidbasic-idir-devtestprod-3567.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=46da2e78-f6d7-414e-9a5e-e21353807452]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=47c85585-5ec7-4691-970f-f6fe3f91ebd6]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=e2bed365-e3e7-4541-a4b8-f1dd45835965]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=300c4fbf-1228-4968-be76-d27a38079105]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=cd58f131-d1c6-42b8-a4aa-6121783968a5]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=e0265be7-394d-45e0-a698-891db72ef1c7]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=aad22f8b-0eac-4152-b0fd-bc50210be416]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=8c6e98fe-75a4-42a7-bf1b-c3d7e579dd0b]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=8fbaa254-7423-4ae2-8755-661e88b7030c]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=ab096687-352c-4eb7-8ff1-c49daccf7988]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=afe980db-1143-4496-95e6-6af762624016]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=44c24238-10b4-4d9a-b971-bfbaf3a57f49]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=7735369f-97b6-40d1-b9d7-d11e2d5e8264]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=2a9d4f7d-00f2-4a2f-8cb4-d5cc120a8a1b]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=f345e9f1-be87-4b71-ae6f-d9e55be698f9]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.keycloak_dev.module.onestopauth.module.client_feb-2-test-team-access-to-json-4918.keycloak_openid_client.this has been changed
  ~ resource "keycloak_openid_client" "this" {
        id                                       = "3b8a90dc-f5bd-4a7f-a5cb-56a881a685ba"
        name                                     = "feb-2-test-team-access-to-json-4918"
      + web_origins                              = []
        # (14 unchanged attributes hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.keycloak_dev.module.onestopauth.module.client_asdfasdfasdf-4.keycloak_generic_client_protocol_mapper.access_token_aud will be created
  + resource "keycloak_generic_client_protocol_mapper" "access_token_aud" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"       = "true"
          + "id.token.claim"           = "false"
          + "included.client.audience" = "asdfasdfasdf-4"
        }
      + id              = (known after apply)
      + name            = "access_token_aud"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-audience-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_asdfasdfasdf-4.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_asdfasdfasdf-4.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_asdfasdfasdf-4.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_asdfasdfasdf-4.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "asdfasdfasdf-4"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_asdfasdfasdf-4.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_asdfasdfasdf-4.keycloak_generic_client_protocol_mapper.idir_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_asdfasdfasdf-4.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_asdfasdfasdf-4.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "PUBLIC"
      + client_id                                = "asdfasdfasdf-4"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + description                              = "CSS App Created"
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = false
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "asdfasdfasdf-4"
      + pkce_code_challenge_method               = "S256"
      + realm_id                                 = "onestopauth"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "http://localhost:3000",
        ]
      + web_origins                              = [
          + "+",
          + "http://localhost:3000",
        ]
    }

  # module.keycloak_dev.module.onestopauth.module.client_feb-3-test-team-access-to-files-4951.keycloak_generic_client_protocol_mapper.access_token_aud will be created
  + resource "keycloak_generic_client_protocol_mapper" "access_token_aud" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"       = "true"
          + "id.token.claim"           = "false"
          + "included.client.audience" = "feb-3-test-team-access-to-files-4951"
        }
      + id              = (known after apply)
      + name            = "access_token_aud"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-audience-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_feb-3-test-team-access-to-files-4951.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_feb-3-test-team-access-to-files-4951.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_feb-3-test-team-access-to-files-4951.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_feb-3-test-team-access-to-files-4951.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "feb-3-test-team-access-to-files-4951"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_feb-3-test-team-access-to-files-4951.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_feb-3-test-team-access-to-files-4951.keycloak_generic_client_protocol_mapper.idir_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_feb-3-test-team-access-to-files-4951.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_feb-3-test-team-access-to-files-4951.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "PUBLIC"
      + client_id                                = "feb-3-test-team-access-to-files-4951"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + description                              = "CSS App Created"
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = false
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "feb-3-test-team-access-to-files-4951"
      + pkce_code_challenge_method               = "S256"
      + realm_id                                 = "onestopauth"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "http://www.test.ca",
        ]
      + web_origins                              = [
          + "+",
          + "http://www.test.ca",
        ]
    }

Plan: 18 to add, 0 to change, 0 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_env" but a value
│ was found in file "/terraform/terraform.tfvars". If you meant to use this
│ value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_aws_account_id"
│ but a value was found in file "/terraform/terraform.tfvars". If you meant
│ to use this value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

------------------------------------------------------------------------

Cost estimation:

Waiting for cost estimate to complete...

Cost estimation:

Resources: 0 of 3456 estimated
           $0.0/mo +$0.0
```

</details>

*Pusher: @junmin-bcgov, Action: `pull_request`*